{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of64.bin", "group1-shard2of64.bin", "group1-shard3of64.bin", "group1-shard4of64.bin", "group1-shard5of64.bin", "group1-shard6of64.bin", "group1-shard7of64.bin", "group1-shard8of64.bin", "group1-shard9of64.bin", "group1-shard10of64.bin", "group1-shard11of64.bin", "group1-shard12of64.bin", "group1-shard13of64.bin", "group1-shard14of64.bin", "group1-shard15of64.bin", "group1-shard16of64.bin", "group1-shard17of64.bin", "group1-shard18of64.bin", "group1-shard19of64.bin", "group1-shard20of64.bin", "group1-shard21of64.bin", "group1-shard22of64.bin", "group1-shard23of64.bin", "group1-shard24of64.bin", "group1-shard25of64.bin", "group1-shard26of64.bin", "group1-shard27of64.bin", "group1-shard28of64.bin", "group1-shard29of64.bin", "group1-shard30of64.bin", "group1-shard31of64.bin", "group1-shard32of64.bin", "group1-shard33of64.bin", "group1-shard34of64.bin", "group1-shard35of64.bin", "group1-shard36of64.bin", "group1-shard37of64.bin", "group1-shard38of64.bin", "group1-shard39of64.bin", "group1-shard40of64.bin", "group1-shard41of64.bin", "group1-shard42of64.bin", "group1-shard43of64.bin", "group1-shard44of64.bin", "group1-shard45of64.bin", "group1-shard46of64.bin", "group1-shard47of64.bin", "group1-shard48of64.bin", "group1-shard49of64.bin", "group1-shard50of64.bin", "group1-shard51of64.bin", "group1-shard52of64.bin", "group1-shard53of64.bin", "group1-shard54of64.bin", "group1-shard55of64.bin", "group1-shard56of64.bin", "group1-shard57of64.bin", "group1-shard58of64.bin", "group1-shard59of64.bin", "group1-shard60of64.bin", "group1-shard61of64.bin", "group1-shard62of64.bin", "group1-shard63of64.bin", "group1-shard64of64.bin"], "weights": [{"name": "tf_distil_bert_for_sequence_classification_3/distilbert/embeddings/word_embeddings/weight", "shape": [30522, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._0/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._1/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._2/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._3/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._4/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/q_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/q_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/k_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/k_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/v_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/v_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/out_lin/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/attention/out_lin/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/sa_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/sa_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/ffn/lin1/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/ffn/lin1/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/ffn/lin2/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/ffn/lin2/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/output_layer_norm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/distilbert/transformer/layer_._5/output_layer_norm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/pre_classifier/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/pre_classifier/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/classifier/kernel", "shape": [768, 2], "dtype": "float32"}, {"name": "tf_distil_bert_for_sequence_classification_3/classifier/bias", "shape": [2], "dtype": "float32"}]}]}